In [1]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [19, 21, 22, 20, 23],
    "Score": [85, 78, 90, 88, 92]
}

df = pd.DataFrame(data)
df

      Name  Age  Score
0    Alice   19     85
1      Bob   21     78
2  Charlie   22     90
3    David   20     88
4      Eva   23     92

In [2]:
df.head(3)
df.describe()
df["Score"].mean()

np.float64(86.6)

In [3]:
df[df["Age"] > 20]
df[df["Score"] > 80]

      Name  Age  Score
0    Alice   19     85
2  Charlie   22     90
3    David   20     88
4      Eva   23     92